# GradientColor Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Gradient..::..GradientColor Property
Gradient Class See Also
---
The property labeled "Color" from the "Gradient" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string GradientColor { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GradientColor As String
	Get
```

Visual C++
---
```text
public:
static property String^ GradientColor {
	String^ get ();
}
```

# Remarks
This property is a "AssetPropertyList" of type "AssetPropertyDoubleArray4d".
# See Also
Gradient Class
Autodesk.Revit.DB.Visual Namespace